RT-Thread-packages/nxp-mcx-series/MCXC162/drivers/fsl_rtc.c
    /* RTC_SR */
    if (0U != (RTC_SR_TIF_MASK & base->SR))
    {
        tmp32 |= (uint32_t)kRTC_TimeInvalidFlag;
    }
    if (0U != (RTC_SR_TOF_MASK & base->SR))
    {
        tmp32 |= (uint32_t)kRTC_TimeOverflowFlag;
    }
    if (0U != (RTC_SR_TAF_MASK & base->SR))
    {
        tmp32 |= (uint32_t)kRTC_AlarmFlag;
    }
#if defined(FSL_FEATURE_RTC_HAS_MONOTONIC) && (FSL_FEATURE_RTC_HAS_MONOTONIC)
    if (0U != (RTC_SR_MOF_MASK & base->SR))
    {
        tmp32 |= (uint32_t)kRTC_MonotonicOverflowFlag;
    }
#endif /* FSL_FEATURE_RTC_HAS_MONOTONIC */
#if (defined(FSL_FEATURE_RTC_HAS_SR_TIDF) && FSL_FEATURE_RTC_HAS_SR_TIDF)
    /*
     * $Branch Coverage Justification$
     * (0U != (RTC_SR_TIDF_MASK & base->SR)) not covered. $ref rtc_c_ref_2$.
     */
    if (0U != (RTC_SR_TIDF_MASK & base->SR)) /* GCOVR_EXCL_BR_LINE */
    {
        /*
        * $Line Coverage Justification$
        * $ref rtc_c_ref_2$.
        */
        tmp32 |= (uint32_t)kRTC_TamperInterruptDetectFlag; /* GCOVR_EXCL_LINE */
    }
#endif /* FSL_FEATURE_RTC_HAS_SR_TIDF */

#if (defined(FSL_FEATURE_RTC_HAS_TDR) && FSL_FEATURE_RTC_HAS_TDR)
    /* RTC_TDR */
    /*
     * $Branch Coverage Justification$
     * (0U != (RTC_TDR_TMF_MASK & base->TDR)) not covered. $ref rtc_c_ref_2$.
     */
    if (0U != (RTC_TDR_TMF_MASK & base->TDR)) /* GCOVR_EXCL_BR_LINE */
    {
        /*
        * $Line Coverage Justification$
        * $ref rtc_c_ref_2$.
        */
        tmp32 |= (uint32_t)kRTC_TestModeFlag; /* GCOVR_EXCL_LINE */
    }
    if (0U != (RTC_TDR_FSF_MASK & base->TDR))
    {
        tmp32 |= (uint32_t)kRTC_FlashSecurityFlag;
    }
#if (defined(FSL_FEATURE_RTC_HAS_TDR_TPF) && FSL_FEATURE_RTC_HAS_TDR_TPF)
    /*
     * $Branch Coverage Justification$
     * (0U != (RTC_TDR_TPF_MASK & base->TDR)) not covered. $ref rtc_c_ref_2$.
     */
    if (0U != (RTC_TDR_TPF_MASK & base->TDR)) /* GCOVR_EXCL_BR_LINE */
    {
        /*
        * $Line Coverage Justification$
        * $ref rtc_c_ref_2$.
        */
        tmp32 |= (uint32_t)kRTC_TamperPinFlag; /* GCOVR_EXCL_LINE */
    }
#endif /* FSL_FEATURE_RTC_HAS_TDR_TPF */
#if (defined(FSL_FEATURE_RTC_HAS_TDR_STF) && FSL_FEATURE_RTC_HAS_TDR_STF)
    /*
     * $Branch Coverage Justification$
     * (0U != (RTC_TDR_STF_MASK & base->TDR)) not covered. $ref rtc_c_ref_2$.
     */
    if (0U != (RTC_TDR_STF_MASK & base->TDR)) /* GCOVR_EXCL_BR_LINE */
    {
        /*
        * $Line Coverage Justification$
        * $ref rtc_c_ref_2$.
        */
        tmp32 |= (uint32_t)kRTC_SecurityTamperFlag; /* GCOVR_EXCL_LINE */
    }
#endif /* FSL_FEATURE_RTC_HAS_TDR_STF */
#if (defined(FSL_FEATURE_RTC_HAS_TDR_LCTF) && FSL_FEATURE_RTC_HAS_TDR_LCTF)
    /*
     * $Branch Coverage Justification$
     * (0U != (RTC_TDR_LCTF_MASK & base->TDR)) not covered. $ref rtc_c_ref_2$.
     */
    if (0U != (RTC_TDR_LCTF_MASK & base->TDR)) /* GCOVR_EXCL_BR_LINE */
    {
        /*
        * $Line Coverage Justification$
        * $ref rtc_c_ref_2$.
        */
        tmp32 |= (uint32_t)kRTC_LossOfClockTamperFlag; /* GCOVR_EXCL_LINE */
    }
#endif /* FSL_FEATURE_RTC_HAS_TDR_LCTF */
#endif /* FSL_FEATURE_RTC_HAS_TDR */

    return tmp32;
}

/*!
 * brief  Clears the RTC status flags.
 *
 * param base RTC peripheral base address
 * param mask The status flags to clear. This is a logical OR of members of the
 *             enumeration ::rtc_status_flags_t
 */
void RTC_ClearStatusFlags(RTC_Type *base, uint32_t mask)
{
    /* The alarm flag is cleared by writing to the TAR register */
    if (0U != (mask & (uint32_t)kRTC_AlarmFlag))
    {
        base->TAR = 0U;
    }

    /* The timer overflow flag is cleared by initializing the TSR register.
     * The time counter should be disabled for this write to be successful
     */
    if (0U != (mask & (uint32_t)kRTC_TimeOverflowFlag))
    {
        base->TSR = 1U;
    }

    /* The timer overflow flag is cleared by initializing the TSR register.
     * The time counter should be disabled for this write to be successful
     */
    if (0U != (mask & (uint32_t)kRTC_TimeInvalidFlag))
    {
        base->TSR = 1U;
    }

#if (defined(FSL_FEATURE_RTC_HAS_TDR) && FSL_FEATURE_RTC_HAS_TDR)
    /* To clear, write logic one to this flag after exiting from all test modes */
    /*
     * $Branch Coverage Justification$
     * (0U != ((uint32_t)kRTC_TestModeFlag & mask)) not covered. $ref rtc_c_ref_2$.
     */
    if (0U != ((uint32_t)kRTC_TestModeFlag & mask)) /* GCOVR_EXCL_BR_LINE */
    {
        /*
        * $Line Coverage Justification$
        * $ref rtc_c_ref_2$.
        */
        base->TDR = RTC_TDR_TMF_MASK; /* GCOVR_EXCL_LINE */
    }
    /* To clear, write logic one to this flag after flash security is enabled */
    /*
     * $Branch Coverage Justification$
     * (0U != ((uint32_t)kRTC_FlashSecurityFlag & mask)) not covered. $ref rtc_c_ref_2$.
     */
    if (0U != ((uint32_t)kRTC_FlashSecurityFlag & mask)) /* GCOVR_EXCL_BR_LINE */
    {
        /*
        * $Line Coverage Justification$
        * $ref rtc_c_ref_2$.
        */
        base->TDR = RTC_TDR_FSF_MASK; /* GCOVR_EXCL_LINE */
    }
#if (defined(FSL_FEATURE_RTC_HAS_TDR_TPF) && FSL_FEATURE_RTC_HAS_TDR_TPF)
    /* To clear, write logic one to the corresponding flag after that tamper pin negates */
    /*
     * $Branch Coverage Justification$
     * (0U != ((uint32_t)kRTC_TamperPinFlag & mask)) not covered. $ref rtc_c_ref_2$.
     */
    if (0U != ((uint32_t)kRTC_TamperPinFlag & mask)) /* GCOVR_EXCL_BR_LINE */
    {
        /*
        * $Line Coverage Justification$
        * $ref rtc_c_ref_2$.
        */
        base->TDR = RTC_TDR_TPF_MASK; /* GCOVR_EXCL_LINE */
    }
#endif /* FSL_FEATURE_RTC_HAS_TDR_TPF */
#if (defined(FSL_FEATURE_RTC_HAS_TDR_STF) && FSL_FEATURE_RTC_HAS_TDR_STF)
    /* To clear, write logic one to this flag after security module has negated its tamper detect */
    /*
     * $Branch Coverage Justification$
     * (0U != ((uint32_t)kRTC_SecurityTamperFlag & mask)) not covered. $ref rtc_c_ref_2$.
     */
    if (0U != ((uint32_t)kRTC_SecurityTamperFlag & mask)) /* GCOVR_EXCL_BR_LINE */
    {
        /*
        * $Line Coverage Justification$
        * $ref rtc_c_ref_2$.
        */
        base->TDR = RTC_TDR_STF_MASK; /* GCOVR_EXCL_LINE */
    }
#endif /* FSL_FEATURE_RTC_HAS_TDR_STF */
#if (defined(FSL_FEATURE_RTC_HAS_TDR_LCTF) && FSL_FEATURE_RTC_HAS_TDR_LCTF)
    /* To clear, write logic one to this flag after loss of clock negates */
    /*
     * $Branch Coverage Justification$
     * (0U != ((uint32_t)kRTC_LossOfClockTamperFlag & mask)) not covered. $ref rtc_c_ref_2$.
     */
    if (0U != ((uint32_t)kRTC_LossOfClockTamperFlag & mask)) /* GCOVR_EXCL_BR_LINE */
    {
        /*
        * $Line Coverage Justification$
        * $ref rtc_c_ref_2$.
        */
        base->TDR = RTC_TDR_LCTF_MASK; /* GCOVR_EXCL_LINE */
    }
#endif /* FSL_FEATURE_RTC_HAS_TDR_LCTF */
#endif /* FSL_FEATURE_RTC_HAS_TDR */
}

#if defined(FSL_FEATURE_RTC_HAS_MONOTONIC) && (FSL_FEATURE_RTC_HAS_MONOTONIC)

/*!
 * brief Reads the values of the Monotonic Counter High and Monotonic Counter Low and returns
 *        them as a single value.
 *
 * param base    RTC peripheral base address
 * param counter Pointer to variable where the value is stored.
 */
void RTC_GetMonotonicCounter(RTC_Type *base, uint64_t *counter)
{
    uint64_t u64temp;

    assert(NULL != counter);

    u64temp  = (uint64_t)base->MCLR;
    *counter = (((uint64_t)base->MCHR << 32U) | u64temp);
}

/*!
 * brief Writes values Monotonic Counter High and Monotonic Counter Low by decomposing
 *        the given single value. The Monotonic Overflow Flag in RTC_SR is cleared due to the API.
 *
 * param base    RTC peripheral base address
 * param counter Counter value
 */
void RTC_SetMonotonicCounter(RTC_Type *base, uint64_t counter)
{
    /* Prepare to initialize the register with the new value written */
    base->MER &= ~RTC_MER_MCE_MASK;

