RT-Thread-packages/nxp-mcx-series/MCXC162/drivers/fsl_rtc.c
    base->MCHR = (uint32_t)((counter) >> 32);
    base->MCLR = (uint32_t)(counter & 0xFFFFFFFFU);
}

/*!
 * brief Increments the Monotonic Counter by one.
 *
 * Increments the Monotonic Counter (registers RTC_MCLR and RTC_MCHR accordingly) by setting
 * the monotonic counter enable (MER[MCE]) and then writing to the RTC_MCLR register. A write to the
 * monotonic counter low that causes it to overflow also increments the monotonic counter high.
 *
 * param base RTC peripheral base address
 *
 * return kStatus_Success: success
 *         kStatus_Fail: error occurred, either time invalid or monotonic overflow flag was found
 */
status_t RTC_IncrementMonotonicCounter(RTC_Type *base)
{
    if (0U != (base->SR & (RTC_SR_MOF_MASK | RTC_SR_TIF_MASK)))
    {
        return kStatus_Fail;
    }

    /* Prepare to switch to increment mode */
    base->MER |= RTC_MER_MCE_MASK;
    /* Write anything so the counter increments*/
    base->MCLR = 1U;

    return kStatus_Success;
}

#endif /* FSL_FEATURE_RTC_HAS_MONOTONIC */

#if defined(FSL_FEATURE_RTC_HAS_TSIC) && FSL_FEATURE_RTC_HAS_TSIC

/*!
 * brief Sets the RTC timer seconds interrupt frequency.
 *
 * This function sets the RTC timer seconds interrupt frequency.
 *
 * param base   RTC peripheral base address
 * param freq   The timer seconds interrupt frequency. This is a member of the
 *               enumeration ::rtc_timer_seconds_interrupt_frequency_t
 */
void RTC_SetTimerSecondsInterruptFrequency(RTC_Type *base, rtc_timer_seconds_interrupt_frequency_t freq)
{
    assert(freq < kRTC_TimerSecondsFrequency128Hz);
    uint32_t reg = base->IER;

    reg &= ~(RTC_IER_TSIC_MASK);
    reg |= RTC_IER_TSIC(freq);

    /* Enable the timer seconds interrupt if not enabled */
    if ((reg & RTC_IER_TSIE_MASK) != 0U)
    {
        reg |= RTC_IER_TSIE_MASK;
    }

    base->IER = reg;
}

#endif /* FSL_FEATURE_RTC_HAS_TSIC */
